export enum Example {
  Email = 'email@local.com',
  Name = 'Ann',
  Password = '12345678',
  Title = 'Гарри Поттер и Тайная Комната',
  Year = 1998,
  Desc = `«Га́рри По́ттер и Та́йная ко́мната» (англ. Harry Potter and the Chamber of Secrets) — второй роман в серии книг про юного волшебника Гарри Поттера, написанный Джоан Роулинг. Книга рассказывает о втором учебном годе в школе чародейства и волшебства Хогвартс, на котором Гарри и его друзья — Рон Уизли и Гермиона Грейнджер — расследуют таинственные нападения на учеников школы, совершаемые неким «Наследником Слизерина». Объектами нападений являются маглорожденные ученики. Все пострадавшие находятся в оцепенении и ни на что не реагируют. Главному герою предстоит доказать свою непричастность к загадочным событиям и вступить в битву с могущественной тёмной силой.`,
  Author = 'Джоан Роулинг',
  Page = 1,
  Id = 1,
}
